In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("data_cleaning_sample.csv")

In [5]:
df

     Name   Age          City  Gender                 Email   Join Date
0    Alice  25.0       NewYork       F    alice@example.com  13-06-2021
1     Bob   30.0  Los Angeles        M       bob@eample.com  15-06-2020
2  Charlie   NaN         Delhi       M  charlie@example.com  20-07-2021
3    David  22.0        Mumbai      M     david@example.com  12/11/2019
4      NaN  28.0         Delhi      F        eve@domain.com         NaN

In [7]:
df.isnull()

   Name    Age   City   Gender   Email  Join Date
0  False  False  False    False  False      False
1  False  False  False    False  False      False
2  False   True  False    False  False      False
3  False  False  False    False  False      False
4   True  False  False    False  False       True

In [8]:
df.isnull().sum()

Name         1
Age          1
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [9]:
df.dropna()

   Name   Age          City  Gender               Email   Join Date
0  Alice  25.0       NewYork       F  alice@example.com  13-06-2021
1   Bob   30.0  Los Angeles        M     bob@eample.com  15-06-2020
3  David  22.0        Mumbai      M   david@example.com  12/11/2019

In [10]:
df.fillna(0)

     Name   Age          City  Gender                 Email   Join Date
0    Alice  25.0       NewYork       F    alice@example.com  13-06-2021
1     Bob   30.0  Los Angeles        M       bob@eample.com  15-06-2020
2  Charlie   0.0         Delhi       M  charlie@example.com  20-07-2021
3    David  22.0        Mumbai      M     david@example.com  12/11/2019
4        0  28.0         Delhi      F        eve@domain.com           0